import React from 'react'
import Layout from '../components/Core/Layout'
import Card from '../components/Core/Card'

const PrivacyPolicy = () => (
  <Layout>
    <div className="container position-relative pt-4">
      <Card>
        <div className="text-center px-4">
          <h3>Privacy Policy นโยบายส่วนบุคคล</h3>
          <p>
            ข้อมูลส่วนบุคคลที่คุณได้ให้หรือใช้งานผ่านเว็บไซต์ของ Luna.Codes ทั้งหมดนั้น
            คุณยอมรับและตกลงว่าเป็นสิทธิของ Luna.Codes โดย Luna.Codes จะเก็บข้อมูล
            รักษาความปลอดภัยและป้องกันไม่ให้ถูกจารกรรมข้อมูล คัดลอก ลบแก้ไข
            เปลี่ยนแปลงได้ในระดับหนึ่ง
          </p>

          <h5>Luna.Codes เก็บข้อมูลอะไรบ้าง</h5>
          <p>
            การใช้งานของผู้ใช้ Luna.Codes เก็บข้อมูลเกี่ยวกับการใช้งานของคุณ เช่น
            การเขียนโค้ดเพื่อแก้โจทย์ปัญหา การดำเนินการที่คุณทำ รวมทั้งเวลา
            ความถี่และระยะเวลาที่คุณทำกิจกรรม ตัวอย่างเช่น Luna.Codes
            จะบันทึกระยะเวลาเมื่อคุณเขียนโค้ดแก้โจทย์ปัญหา
          </p>
          <p>
            ข้อมูลส่วนตัว Luna.Codes เก็บข้อมูลส่วนตัวของคุณบางส่วน เช่น ชื่อนามสกุล อีเมลล์
            รวมถึงสถานศึกษา เมื่อคุณสมัครใช้งานบัญชีผู้ใช้
          </p>

          <h5>Luna.Codes นำข้อมูลไปใช้อย่างไรบ้าง</h5>
          <p>
            เพื่อดำเนินการและสนับสนุน Senior project ของนักศึกษาคณะเทคโนโลยีสารสนเทศ
            มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรี ตัวอย่างเช่น
            นำข้อมูลการใช้งานของผู้ใช้ไปวิเคราะห์และพัฒนาหลักสูตรการเรียนการสอนของคณะเทคโนโลยีสารสนเทศ
            มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรี
          </p>
        </div>
      </Card>
    </div>
  </Layout>
)

export default PrivacyPolicy
